In [ ]:
select name from customer
where referee_id != 2 or referee_id is null

In [ ]:
# 183. Customers Who Never Order
select c.name as Customers from customers c
where c.id NOT in (select customerId from orders)

-- second method

select c.name as Customers from customers c
left join orders o on o.customerid = c.id
where o.id is null

In [ ]:
# 1873. Calculate Special Bonus
SELECT employee_id,
CASE
    WHEN employee_id%2 = 1 and name not like 'M%' THEN salary
    ELSE 0
END AS bonus
FROM Employees;

select employee_id ,if(employee_id % 2 =1 and name not like 'M%',salary ,0 ) as bonus 
from Employees order by employee_id ;

In [ ]:
# 627. Swap Salary
update salary
SET sex = case 
                when sex = 'm' then 'f'
                else 'm'
                END

In [ ]:
# 196. Delete Duplicate Emails
DELETE p2 FROM Person p1,
    Person p2
WHERE
    p1.Email = p2.Email AND p2.Id > p1.Id

In [ ]:
#1667. Fix Names in a Table
select user_id, concat(upper(LEFT(name, 1)) , lower(SUBSTRING(name, 2,2000))) as name  from users
order by user_id

In [ ]:
# 1484. Group Sold Products By The Date
select sell_date, count(distinct product) as num_sold, string_agg(product,',') as products from (select distinct sell_date, product from activities) as t
group by sell_date
order by sell_date

-- MySQL
SELECT a.sell_date, COUNT(DISTINCT(a.product)) AS num_sold, GROUP_CONCAT(DISTINCT(a.product) ORDER BY a.product) AS products FROM Activities a
GROUP BY a.sell_date
ORDER BY a.sell_date ASC;

## string_agg in MSSQL and GROUP_CONCAT in MySQL.

In [ ]:
# 1527. Patients With a Condition
select * from patients
where conditions like '% DIAB1%' or conditions like 'DIAB1%'

In [ ]:
# 1965. Employees With Missing Information
select s.employee_id from employees e
full outer join salaries s on e.employee_id = s.employee_id
where e.employee_id is null
union
select e.employee_id from employees e
full outer join salaries s on e.employee_id = s.employee_id
where s.employee_id is null

In [ ]:
# 1795. Rearrange Products Table
select product_id,'store1' as store, store1 as price from Products
where store1 is not null 
union
select product_id,'store2' as store, store2 as price from Products
where store2 is not null 
union
select product_id,'store3' as store, store3 as price from Products
where store3 is not null

In [ ]:
# 608. Tree Node
select id,
Case
    When p_id is null then 'Root'
    When p_id in (select id from tree) and id in (select p_id from tree) then 'Inner'
    Else 'Leaf'
END as type
from tree

In [ ]:
# 176. Second Highest Salary
MySQL:
    
select IFNULL(
(select distinct salary from employee
order by salary desc
limit 1 offset 1)  , NUll) as  SecondHighestSalary

In [ ]:
# 175. Combine Two Tables
select p.firstname, p.lastname, a.city, a.state from person p
left join address a on p.personId = a.personId

In [ ]:
# 1581. Customer Who Visited but Did Not Make Any Transactions
select customer_id, count(*) as count_no_trans  from visits
where visit_id not in (select distinct visit_id from transactions)
group by customer_id

In [ ]:
# 1148. Article Views I
select distinct author_id as id from views
where author_id = viewer_id
order by author_id

In [ ]:
# 197. Rising Temperature
select w1.id as Id from weather w1
inner join weather w2 on datediff(day,w2.recordDate,w1.recordDate) = 1
where w1.temperature > w2.temperature

# The order inside the function datediff matters. 
# DATEDIFF(interval, date1, date2) if date2 > date1, then the result will be positive.

In [ ]:
# 607. Sales Person
select name from SalesPerson
where name not in (
select s.name from SalesPerson s
inner join orders o on o.sales_id = s.sales_id
inner join Company c on c.com_id = o.com_id
where c.name = 'RED')

In [ ]:
#1141. User Activity for the Past 30 Days I

select activity_date as day , count(distinct user_id) as active_users  from activity
group by activity_Date
having 
datediff(day,activity_date,'2019-07-27') < 30 
and 
datediff(day,activity_date,'2019-07-27') > 0

In [ ]:
#1693. Daily Leads and Partners

select date_id, make_name,
count(distinct lead_id) as unique_leads,
count(distinct partner_id) as unique_partners
from DailySales
group by date_id, make_name

In [ ]:
# 1729. Find Followers Count
select user_id, count(distinct follower_id) as followers_count from Followers
group by user_id
order by user_id

In [ ]:
#586. Customer Placing the Largest Number of Orders

select customer_number from (select customer_number, count(customer_number) as freq from orders
group by customer_number) as t
where freq = (select max(freq) from (select customer_number, count(customer_number) as freq from orders
group by customer_number) as t2)
# This code prints all of the maximum orderers
---

select top 1 customer_number from orders
group by customer_number
order by count(order_number) desc

---

# Also we can use with clause
with t (customer_number, freq)
as 
(select customer_number, count(customer_number) as freq from orders
 group by customer_number)
select customer_number from t
where freq = (select max(freq) from t)

In [ ]:
# 511. Game Play Analysis I

select player_id, min(event_date) as first_login from activity
group by player_id

In [ ]:
# 1890. The Latest Login in 2020

select user_id, max(time_stamp) as last_stamp from logins
where year(time_stamp) = 2020
group by user_id

In [ ]:
# 1741. Find Total Time Spent by Each Employee

select event_day as day, emp_id, (sum(out_time) - sum(in_time)) as total_time from Employees
group by emp_id, event_day

In [ ]:
# 1393. Capital Gain/Loss

select stock_name, sum(profit) as capital_gain_loss from (select stock_name, 
    CASE
        when operation = 'Buy' then -price
        when operation = 'Sell' then price
    END AS profit
from stocks) as t
group by stock_name

In [ ]:
# 1407. Top Travellers
select u.name , isnull(sum(distance),0) as travelled_distance from rides r
right join users u on u.id = r.user_id
group by u.name, u.id
order by travelled_distance desc, u.name asc

In [ ]:
# 1158. Market Analysis I
select u.user_id as buyer_id, u.join_date, count(o.order_id) as orders_in_2019 from users u 
left join orders o on u.user_id = o.buyer_id and year(o.order_date) = 2019
group by u.user_id, u.join_date

## Very good question. Pay attendtion to the join statement.

In [ ]:
# 182. Duplicate Emails

select email from person
group by email
having count(id) > 1

In [ ]:
# 1050. Actors and Directors Who Cooperated At Least Three Times

select actor_id, director_id from ActorDirector
group by actor_id, director_id
having count(timestamp) >= 3

In [ ]:
# 1587. Bank Account Summary II

select u.name as NAME, sum(t.amount) as BALANCE from Users u
left join transactions t on u.account = t.account
group by u.account, u.name
having sum(t.amount) > 10000

In [ ]:
# 1084. Sales Analysis III

select p.product_id, p.product_name from product p
inner join sales s on s.product_id = p.product_id
group by p.product_id, p.product_name
having max(s.sale_date) <= '2019-03-31' and min(s.sale_date) >= '2019-01-01'

In [ ]:
# 1699. Number of Calls Between Two Persons

-- MYSQL
SELECT LEAST(from_id,to_id) as person1,
GREATEST(from_id,to_id) as person2,
COUNT(*) as call_count,
SUM(duration) as total_duration
FROM Calls
GROUP BY person1,person2;
# Memorize these MySQL functions: GREATEST and LEAST

-- MSSQL
with CTE as 
(SELECT 
    CASE
        WHEN from_id > to_id THEN to_id
        ELSE from_id
    END AS person1,
    CASE
        WHEN from_id > to_id THEN from_id
        ELSE to_id
    END AS person2,
    duration
FROM Calls)

select person1, person2, count(duration) as call_count, sum(duration) as total_duration from CTE
group by person1, person2

# In MS SQL you can't use the columns created by CASE statement in group by or where statement

# Several CTE are possbile: with CTE1 as(select ...), CTE2 as (select ...)

In [ ]:
# 1251. Average Selling Price

select u.product_id, cast(round(sum(u.units*1.0* p.price) / sum(units),2) as numeric(36,2)) as average_price
from UnitsSold u
inner join prices p on u.product_id = p.product_id and (u.purchase_date >= p.start_date and u.purchase_date <= p.end_date)
group by u.product_id

# Cast(col as nnumeric(36,2)) -> only two digits after comma
# or decimal

In [ ]:
# 1571. Warehouse Manager

select w.name as warehouse_name, sum(w.units*p.width*p.length*p.height) as volume from Warehouse w
inner join products p on w.product_id = p.product_id
group by w.name

In [ ]:
# 1445. Apples & Oranges

-- MS SQL
with CTE as (
select sale_date,
    CASE 
        when fruit = 'apples' then sold_num
        when fruit = 'oranges' then -sold_num
    END AS col
from Sales)

select sale_date, sum(col) as diff from CTE
group by sale_date
order by sale_date

-- MySQL
select sale_date, sum(case when fruit='apples' then sold_num else -sold_num end) as diff
from sales
group by sale_date

In [ ]:
# 1193. Monthly Transactions I

-- MySQL
select DATE_FORMAT(trans_date, "%Y-%m") as month, country, count(amount) as trans_count, sum(state = 'approved') as approved_count, sum(amount) as trans_total_amount, 
sum(
    CASE 
        When state = 'approved' then amount
        ELSE 0
    END
    ) as approved_total_amount
    
from Transactions
group by country, month

# Tip: learn DATE_FORMAT(trans_date, "%Y-%m") for MySQL.
# Tip: sum(state = 'approved') in MySQL could be very useful
# Tip: review the sum of a case condition. You can do sum on a case statement.

In [ ]:
# 1633. Percentage of Users Attended a Contest

select contest_id, cast(round(count(user_id) * 100.0 / (select count(user_id) from users) ,2) as numeric(36,2) ) as percentage from Register 
group by contest_id
order by percentage DESC, contest_id ASC

In [ ]:
# 1173. Immediate Food Delivery I

-- MSSQL
WITH CTE as (
select 
    CASE
        WHEN order_date =  customer_pref_delivery_date THEN 1.0
        ELSE 0
    END AS ontime 
from delivery)

select round(avg(ontime) * 100.0,2) as immediate_percentage  from CTE

-- MySQL
select round(sum(
    CASE
        WHEN order_date =  customer_pref_delivery_date THEN 1
        ELSE 0
    END
    ) * 100.0 / count(delivery_id),2) as immediate_percentage 
from delivery

In [ ]:
# 1211. Queries Quality and Percentage

-- MySQL
SELECT
    query_name,
    ROUND(AVG(rating/position), 2) AS quality,
    ROUND(AVG(rating < 3)*100, 2) AS poor_query_percentage
FROM Queries
GROUP BY query_name

In [ ]:
# 1607. Sellers With No Sales

select seller_name from seller
where seller_name not in (select s.seller_name from seller s
inner join orders o on s.seller_id = o.seller_id
where year(sale_date) = 2020)
order by seller_name

In [ ]:
# 

with CTE as(
select num, count(num) as ct from MyNumbers
group by num)

select max(num) as num from CTE
where ct = 1

# Max function can return Null
# Tip: you can't use a column created by an agregate function in where clause:
select num, count(num) as ct from MyNumbers
where ct = 1
group by num
# This won't work. Instead:
select num, count(num) as ct from MyNumbers
group by num
having count(num) = 1

In [ ]:
# 1112. Highest Grade For Each Student

with max_grade_per_student as (
select student_id , max(grade) as grade from Enrollments
group by student_id)

select m.student_id, min(e.course_id) as course_id, max(m.grade) as grade from max_grade_per_student m
inner join Enrollments e on m.student_id = e.student_id
where m.grade = e.grade
group by m.student_id
order by m.student_id asc

In [ ]:
# 1398. Customers Who Bought Products A and B but Not C

-- MSSQL
with CTE as (
select customer_id, 
    sum(CASE 
        When product_name = 'A' then 1
        else 0
        end) as A_cnt,
    sum(CASE 
        When product_name = 'B' then 1
        else 0
        end) as B_cnt,
    sum(CASE 
        When product_name = 'C' then 1
        else 0
        end) as C_cnt
    from orders
    group by customer_id
    
)

select ct.customer_id, c.customer_name from CTE ct
inner join customers c on ct.customer_id   = c.customer_id  
where ct.A_cnt > 0 and ct.B_cnt > 0 and ct.C_cnt = 0

# Tip: pay close attention to how to end sum(CASE).

-- MySQL
select o.customer_id, c.customer_name from orders o
inner join customers c on o.customer_id   = c.customer_id  
group by o.customer_id
having sum(o.product_name = 'A') > 0 and sum(o.product_name = 'B') > 0 and sum(o.product_name = 'C') = 0

In [ ]:
# 1440. Evaluate Boolean Expression

select e.left_operand, e.operator, e.right_operand,
    CASE
        when operator = '=' and v1.value = v2.value then 'true'
        when operator = '=' and v1.value != v2.value then 'false'
        when operator = '>' and v1.value > v2.value then 'true'
        when operator = '>' and v1.value !> v2.value then 'false'
        when operator = '<' and v1.value < v2.value then 'true'
        when operator = '<' and v1.value !< v2.value then 'false'
        END as value
from Expressions e
inner join variables v1 on e.left_operand = v1.name
inner join variables v2 on e.right_operand = v2.name

-- or

select e.left_operand, e.operator, e.right_operand,
    CASE
        when operator = '=' and v1.value = v2.value then 'true'
        when operator = '>' and v1.value > v2.value then 'true'
        when operator = '<' and v1.value < v2.value then 'true'
        else 'false'
        END as value
from Expressions e
inner join variables v1 on e.left_operand = v1.name
inner join variables v2 on e.right_operand = v2.name

In [ ]:
# 1440. Evaluate Boolean Expression

with CTE as(
select user2_id as usr from Friendship
where user1_id = 1
union 
select user1_id as usr from Friendship
where user2_id = 1)
-- CTE2 as(
--     select distinct page_id from likes
--     where user_id = 1)
    
select distinct isnull(l.page_id,' ') as recommended_page from likes l
right join CTE c on c.usr = l.user_id and l.page_id not in (select distinct page_id from likes
    where user_id = 1)

In [ ]:
# 1264. Page Recommendations

with CTE as(
select user2_id as usr from Friendship
where user1_id = 1
union 
select user1_id as usr from Friendship
where user2_id = 1)
    
select distinct l.page_id as recommended_page from likes l
inner join CTE c on c.usr = l.user_id 
where l.page_id not in (select distinct page_id from likes
    where user_id = 1)

-- MySQL
select distinct page_id as recommended_page
from
(select
case
when user1_id=1 then user2_id
when user2_id=1 then user1_id
end as user_id
from Friendship) a
join Likes
on a.user_id=Likes.user_id
where page_id not in (select page_id from Likes where user_id=1)

In [ ]:
# 570. Managers with at Least 5 Direct Reports

select e1.name from employee e1
inner join employee e2 on e1.id = e2.managerId
group by e1.id
having count(e2.managerId) >= 5

In [ ]:
# 1303. Find the Team Size

# MySQL with  
With cte as (
    select team_id, count(employee_id) as cnt from employee 
    group by team_id
    )
    
select e1.employee_id as employee_id , c.cnt as team_size from employee e1
inner join cte c on e1.team_id = c.team_id
group by e1.employee_id


# MS SQL partition by
select employee_id, count(*) over(partition by team_id) as team_size
from employee

In [ ]:
# 1280. Students and Examinations

select s.student_id, s.student_name, sub.subject_name, count(e.subject_name) as attended_exams from students s
CROSS JOIN Subjects sub 
left join Examinations e on e.student_id = s.student_id and sub.subject_name = e.subject_name
group by s.student_id, s.student_name, sub.subject_name
order by s.student_id, sub.subject_name

# Count(column) with count non-Null values. Count(*) will count whole values including nulls.

In [ ]:
# 1501. Countries You Can Safely Invest In

select C.name as country from Country C
left join Person P on C.country_code = Left(phone_number,3)
inner join Calls calls on calls.caller_id  = P.id or calls.callee_id  = P.id
group by C.name
having AVG(duration*1.0) > (select AVG(duration * 1.0) as ga from calls)

# Note: I think you can't use column alias inside having clause. For instance, if you named AVG(duration*1.0) as av
# in the select statement, you cant use having av > 5. It won't work.

In [ ]:
# 184. Department Highest Salary

with CTE as (
select  departmentId, max(salary) as ms from Employee
    group by departmentId
)

select D.name as Department, E.name as Employee, E.salary as Salary from Department D
inner join CTE on CTE.departmentId = D.id
inner join Employee E on E.departmentId = D.id
where E.salary = CTE.ms

In [ ]:
# 580. Count Student Number in Departments

select d.dept_name, count(student_name) as student_number from Department d
left join student s on d.dept_id = s.dept_id
group by d.dept_id, d.dept_name
order by student_number desc, d.dept_name

In [ ]:
# 1294. Weather Type in Each Country

select c.country_name, 
Case
    When avg(w.weather_state*1.0) <= 15 then 'Cold'
    When avg(w.weather_state*1.0) >= 25 then 'Hot'
    Else 'Warm'
End as weather_type
    

from weather w
inner join Countries c on c.country_id = w.country_id
where month(day) = 11
group by c.country_name

# Tip: you can use avg or other aggregate functions inside case. Of course there should be aa group by statement
# in your select clause.

In [ ]:
# 626. Exchange Seats

select 
Case
    When id%2 = 1 and id != (select count(id) from seat) then id+1
    When id%2 = 0 then id-1
    ELSE id
END as id, student
from seat 
order by id

In [ ]:
# 1783. Grand Slam Titles

-- MSSQL
with CTE as (select Wimbledon as t, count(year) as cnt from Championships
group by Wimbledon

union all

select Fr_open as t, count(year) as cnt from Championships
group by Fr_open
            
union all

select US_open as t, count(year) as cnt from Championships
group by US_open
            
union all

select Au_open as t, count(year) as cnt from Championships
group by Au_open)

select c.t as player_id, p.player_name, sum(cnt) as grand_slams_count from CTE c
inner join players p on c.t = p.player_id
group by t, p.player_name

-- MySQL
SELECT player_id,player_name,
SUM(player_id=Wimbledon)+SUM(player_id=Fr_open)+SUM(player_id=US_open)+SUM(player_id=Au_open)
as grand_slams_count
FROM Players
JOIN Championships
ON player_id=Wimbledon or player_id=Fr_open or player_id=US_open or player_id=Au_open
GROUP BY player_id;

## From this point on I will only use MySQL

In [ ]:
# 1164. Product Price at a Given Date

select distinct product_id, 10 as price from products
group by product_id
having min(change_date)> '2019-08-16'

union 

select product_id, new_price from products
where (product_id,change_date) in
(select product_id, max(change_date) from products
where change_date <= '2019-08-16'
group by product_id)

# Pay attention to the where clause used in this problem.

In [ ]:
# 603. Consecutive Available Seats

select distinct C1.seat_id from Cinema C1
inner join Cinema C2 on C1.seat_id = C2.seat_id + 1 or C1.seat_id = C2.seat_id - 1
where C1.free = 1 and C2.free = 1
order by seat_id

# Also we can use abs(C1.seat_id - C2.seat_id) = 1

In [ ]:
# 1731. The Number of Employees Which Report to Each Employee

select distinct e1.reports_to as employee_id, e2.name, count(e1.reports_to) as reports_count, round(AVG(e1.age)) as average_age from Employees e1
inner join Employees e2 on e1.reports_to = e2.employee_id
group by e1.reports_to
order by employee_id

# My SQL round function

In [ ]:
# 1747. Leetflex Banned Accounts

select l1.account_id from loginfo l1
inner join loginfo l2 on l1.account_id = l2.account_id and l1.ip_address != l2.ip_address
where l1.login between l2.login and l2.logout 
or
l1.logout between l2.login and l2.logout
group by l1.account_id

-- second method

select distinct l1.account_id from loginfo l1
inner join loginfo l2 on l1.account_id = l2.account_id and l1.ip_address != l2.ip_address
where l1.login between l2.login and l2.logout 
or
l1.logout between l2.login and l2.logout

# Tip: sometimes distinct could do the job isntead of group by

In [ ]:
# 181. Employees Earning More Than Their Managers

select e1.name as Employee  from employee e1
inner join employee e2 on e1.managerid = e2.id
where e1.salary > e2.salary

In [ ]:
# 1459. Rectangles Area

select p1.id as P1, p2.id as P2, abs((p1.x_value - p2.x_value)*(p1.y_value - p2.y_value)) as AREA 
from Points p1
inner join points p2 on p1.x_value != p2.x_value and p1.y_value != p2.y_value and 
p1.id < p2.id
-- inner join points p2 on abs((p1.x_value - p2.x_value)*(p1.y_value - p2.y_value))
order by area desc, p1.id asc, p2.id asc

# Tip: join conditions could be fansy!

In [ ]:
# 180. Consecutive Numbers

select distinct l1.num as ConsecutiveNums from Logs l1
inner join logs l2 on l1.id = l2.id + 1
inner join logs l3 on l1.id = l3.id + 2
where l1.num = l2.num and l2.num = l3.num

-- second method

select distinct Num as ConsecutiveNums
from Logs
where (Id + 1, Num) in (select * from Logs) and (Id + 2, Num) in (select * from Logs)

In [ ]:
# 1988. Find Cutoff Score for Each School

select school_id, -1 as score from schools
where capacity < (select min(student_count) from exam)

union

select s.school_id, min(e.score) from schools s
inner join exam e on s.capacity >= e.student_count and s.capacity >= (select min(student_count) from exam)
group by s.school_id

--- second method

select s.school_id, ifnull(min(e.score),-1) as score from schools s
left join exam e on s.capacity >= e.student_count
group by s.school_id

# Tip learn the ifnull function of MySQL here. You can use (aggregation functions inside ifnull.)

In [ ]:
# 1549. The Most Recent Orders for Each Product
with CTE as (
    select p.product_id, max(o.order_date) from products p
    inner join orders o on p.product_id = o.product_id
    group by p.product_id
)
select p.product_name, p.product_id, o.order_id, o.order_date from products p
inner join orders o on p.product_id = o.product_id
where (p.product_id,o.order_date) in (select * from CTE)
order by p.product_name asc, p.product_id asc, o.order_id asc

# Tip: learn the where clause in this problem. It is really helpful.

In [ ]:
# 1321. Restaurant Growth

select distinct visited_on, amount, round(amount/7, 2) as average_amount
from (select visited_on, 
      sum(amount) over (order by visited_on range between interval 6 day preceding and current row) as amount,
      dense_rank() over (order by visited_on) as rk
      from Customer) as t
where rk >= 7

# Learn the Window function format from this question.
# The row_number gives continuous numbers, while rank and dense_rank give the same 
# rank for duplicates, but the next number in rank is as per continuous 
# order so you will see a jump but in dense_rank doesn't have any gap in rankings.

In [ ]:
# 1045. Customers Who Bought All Products

select customer_id from customer
group by customer_id
having count(distinct product_key) = (select count(*) from product)

In [ ]:
# 1341. Movie Rating

(select U.name as results from MovieRating M
inner join Users U on M.user_id = U.user_id
group by M.user_id
order by count(M.movie_id) desc, U.name asc
Limit 1)

union

(select M2.title as results from MovieRating M
inner join Movies M2 on M2.movie_id = M.movie_id
where month(M.created_at) = 2
group by M.movie_id
order by avg(M.rating) desc, M2.title asc
Limit 1)

# Tips: You should use parenthesis between union statement when you have order by clause. 
# Tip: you are allowed to use order by aggregate functions like this problem.
# Tip: MySQL function: Month returns the number of the month

In [ ]:
# 1867. Orders With Maximum Quantity Above Average

with CTE as (
select avg(quantity) as av from OrdersDetails 
group by order_id)

select order_id  from OrdersDetails
group by order_id
having max(quantity) > (select max(av) from CTE)

# Tip: You can't use max(avg). You should use them separately.

In [ ]:
# 550. Game Play Analysis IV

With CTE as (
    select player_id, min(event_date) as mn from activity
    group by player_id
)
select round(count(distinct A1.player_id) / (select count(distinct player_id) from Activity),2) as fraction from Activity A1
Inner join CTE C on datediff(A1.event_date, C.mn) = 1 and A1.player_id = C.player_id

# Tip: Datediff(x,y) is x - y not y - x

In [ ]:
# 262. Trips and Users

select request_at as Day, round((sum(status = 'cancelled_by_driver') + sum(status = 'cancelled_by_client')) / count(distinct id),2) as 'Cancellation Rate'
from trips t
inner join users u1 on t.client_id = u1.users_id
inner join users u2 on t.driver_id = u2.users_id
where u1.banned = 'No' and u2.banned = 'No' and request_at between "2013-10-01" and "2013-10-03"
group by request_at

# Tip: as Cancellation Rate does not work because there is a space. You should use "Cancellation Rate" instead.